; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v7)
             (pred_3 ?v5 ?v4)
             (pred_6 ?v2 ?v4)
             (pred_7 ?v13 ?v2 )
	     (pred_9 ?v2)
             (pred_8 ?v3)
             (pred_12 ?v5)
             (pred_5 ?v4)
             (pred_11 ?v2)
             (pred_4 ?v5)
             (pred_2 ?v2)
             (pred_1 ))



(:action op_2
:parameters (?v12 ?v10 ?v11 ?v9)
:precondition (and (pred_8 ?v12) (pred_8 ?v10) (pred_12 ?v11) (pred_5 ?v9)
          (pred_10 ?v12 ?v10) (pred_3 ?v11 ?v9)
                   (pred_6 ?v10 ?v9) (pred_9 ?v12) 
                   (pred_11 ?v10) (pred_4 ?v11))
:effect (and  (pred_2 ?v10) (not (pred_11 ?v10))))


(:action op_1
:parameters (?v12 ?v1)
:precondition (and (pred_8 ?v12) (pred_8 ?v1)
               (pred_9 ?v12) (pred_10 ?v12 ?v1) (pred_2 ?v1))
:effect (and (pred_9 ?v1) (not (pred_9 ?v12))))

(:action op_5
:parameters (?v12 ?v11)
:precondition (and (pred_8 ?v12) (pred_12 ?v11) 
                  (pred_9 ?v12) (pred_7 ?v11 ?v12) (pred_1 ))
:effect (and (pred_4 ?v11)
   (not (pred_7 ?v11 ?v12)) (not (pred_1 ))))


(:action op_4
:parameters (?v12 ?v8 ?v6)
:precondition (and (pred_8 ?v12) (pred_12 ?v8) (pred_12 ?v6)
                  (pred_9 ?v12) (pred_4 ?v6) (pred_7 ?v8 ?v12))
:effect (and (pred_4 ?v8) (pred_7 ?v6 ?v12)
        (not (pred_4 ?v6)) (not (pred_7 ?v8 ?v12))))

(:action op_3
:parameters (?v12 ?v11)
:precondition (and (pred_8 ?v12) (pred_12 ?v11) 
                  (pred_9 ?v12) (pred_4 ?v11))
:effect (and (pred_1 ) (pred_7 ?v11 ?v12) (not (pred_4 ?v11)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_01 obj_22 obj_04 obj_12 obj_18 obj_07 obj_02 obj_21 obj_16 obj_10 obj_06 obj_15 obj_05 obj_08 obj_20
    obj_11 obj_09 obj_03
    obj_17 obj_13 obj_14
    )

    (:init
       (pred_1)

       (pred_8 obj_19)
       (pred_8 obj_01)
       (pred_8 obj_22)
       (pred_8 obj_04)
       (pred_8 obj_12)
       (pred_8 obj_18)
       (pred_8 obj_07)
       (pred_8 obj_02)
       (pred_8 obj_21)
       (pred_8 obj_16)
       (pred_8 obj_10)
       (pred_8 obj_06)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_20)
       (pred_5 obj_11)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_12 obj_17)
       (pred_12 obj_13)
       (pred_12 obj_14)

       (pred_10 obj_19 obj_12)
       (pred_10 obj_19 obj_01)
       (pred_10 obj_01 obj_18)
       (pred_10 obj_01 obj_22)
       (pred_10 obj_01 obj_19)
       (pred_10 obj_22 obj_07)
       (pred_10 obj_22 obj_04)
       (pred_10 obj_22 obj_01)
       (pred_10 obj_04 obj_02)
       (pred_10 obj_04 obj_22)
       (pred_10 obj_12 obj_21)
       (pred_10 obj_12 obj_18)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_01)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_07 obj_22)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_02 obj_04)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_21 obj_15)
       (pred_10 obj_21 obj_16)
       (pred_10 obj_21 obj_12)
       (pred_10 obj_16 obj_05)
       (pred_10 obj_16 obj_10)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_16 obj_21)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_16)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_15 obj_05)
       (pred_10 obj_15 obj_21)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_16)
       (pred_10 obj_05 obj_15)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_08)
       (pred_11 obj_15)
       (pred_11 obj_21)
       (pred_11 obj_06)
       (pred_6  obj_15 obj_11)
       (pred_6  obj_21 obj_09)
       (pred_6  obj_06 obj_03)
       (pred_2 obj_19)
       (pred_2 obj_01)
       (pred_2 obj_22)
       (pred_2 obj_04)
       (pred_2 obj_12)
       (pred_2 obj_18)
       (pred_2 obj_07)
       (pred_2 obj_02)
       (pred_2 obj_16)
       (pred_2 obj_10)
       (pred_2 obj_05)
       (pred_2 obj_08)
       (pred_2 obj_20)

       (pred_3  obj_17 obj_11)
       (pred_3  obj_13 obj_09)
       (pred_3  obj_14 obj_03)
       (pred_7 obj_17 obj_22)
       (pred_7 obj_13 obj_20)
       (pred_7 obj_14 obj_20)
       (pred_9 obj_02)
    )

    (:goal (and
       (pred_7 obj_17 obj_19)
       (pred_7 obj_13 obj_05)
    ))
(:constraints
  (always (not (pred_9 obj_01)))
)
)

; plan
1. (op_1 obj_02 obj_07)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_07)
   goals met: 0 of 2
2. (op_1 obj_07 obj_10)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_10)
   goals met: 0 of 2
3. (op_1 obj_10 obj_08)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_08)
   goals met: 0 of 2
4. (op_1 obj_08 obj_20)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_20)
   goals met: 0 of 2
5. (op_5 obj_20 obj_13)
   deleted: (pred_7 obj_13 obj_20) (pred_1)
   added: (pred_4 obj_13)
   goals met: 0 of 2
6. (op_1 obj_20 obj_08)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_08)
   goals met: 0 of 2
7. (op_1 obj_08 obj_05)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_05)
   goals met: 0 of 2
8. (op_3 obj_05 obj_13)
   deleted: (pred_4 obj_13)
   added: (pred_1) (pred_7 obj_13 obj_05)
   goals met: 1 of 2
9. (op_1 obj_05 obj_08)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_08)
   goals met: 1 of 2
10. (op_1 obj_08 obj_10)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_10)
   goals met: 1 of 2
11. (op_1 obj_10 obj_07)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_07)
   goals met: 1 of 2
12. (op_1 obj_07 obj_22)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_22)
   goals met: 1 of 2
13. (op_5 obj_22 obj_17)
   deleted: (pred_7 obj_17 obj_22) (pred_1)
   added: (pred_4 obj_17)
   goals met: 1 of 2
14. (op_1 obj_22 obj_07)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_07)
   goals met: 1 of 2
15. (op_1 obj_07 obj_18)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_18)
   goals met: 1 of 2
16. (op_1 obj_18 obj_12)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_12)
   goals met: 1 of 2
17. (op_1 obj_12 obj_19)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_19)
   goals met: 1 of 2
18. (op_3 obj_19 obj_17)
   deleted: (pred_4 obj_17)
   added: (pred_1) (pred_7 obj_17 obj_19)
   goals met: 2 of 2
